backend/modules/music/controllers/MusicController.php

    public function actionDeleteAll(){
        $data = Yii::$app->request->post();
        if($data){
            $model = new Music();

            $count = $model->deleteAll(["in","id",$data['keys']]);
---
DELETE FROM `music` WHERE `id`=33

    protected function findModel($id)
    {
        if (($model = Music::findOne($id)) !== null) {
---
SELECT * FROM `music` WHERE `id`='33'