backend/modules/rbac/components/MenuHelper.php

    public static function getAssignedMenu($userId, $root = null, $callback = null, $refresh = false)
    {
        $config = Configs::instance();

        /* @var $manager \yii\rbac\BaseManager */
        $manager = Configs::authManager();

        $menus = Menu::find()->asArray()->indexBy('id')->all();
---
SELECT * FROM `menu`